# GetFabricationServiceSettings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationServiceSettings..::..GetFabricationServiceSettings Method
FabricationServiceSettings Class See Also
---
Gets the settings element in the document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static FabricationServiceSettings GetFabricationServiceSettings(
	Document doc
)
```

Visual Basic
---
```text
Public Shared Function GetFabricationServiceSettings ( _
	doc As Document _
) As FabricationServiceSettings
```

Visual C++
---
```text
public:
static FabricationServiceSettings^ GetFabricationServiceSettings(
	Document^ doc
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..Document The document where the settings element is found.
# ### Return Value
The element which stores the fabrication service settings for the document.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FabricationServiceSettings Class
Autodesk.Revit.DB Namespace